/** --------------------------------------------------
* @Project	: 蓝风·嵌入式开发STM32
* @Version	: V 1.0
* @Hardware	: STM32F4XX
* @Author	: Xu Zhe
* @Date		: 2021-07-01
* @Brief	: 01-LED，LED跑马灯测试
---------------------------------------------------*/

/********** 头 文 件 **********/
#include "stm32f4xx_it.h"
#include "led.h"

/********** 方    法 **********/
/** --------------------------------------------------
* @Function	: main
* @Brief	: 主函数
* @param	: void
* @return	: int
---------------------------------------------------*/
int main(void)
{
	SysTick_Init();		// 延时函数初始化
	LED_Init();			// LED灯对应GPIO口初始化
	while(1)
	{
		LED_Test();
	}
}

/*********** Copyright © 2021 蓝风实验室 ***********/
