/** --------------------------------------------------
* @Project	: 蓝风·嵌入式开发STM32
* @Version	: V 1.0
* @Hardware	: STM32F4XX
* @Author	: Xu Zhe
* @Date		: 2021-07-01
* @Brief	: 00-Template，项目模板
---------------------------------------------------*/

/********** 头 文 件 **********/
#include "stm32f4xx_it.h"

/********** 方    法 **********/
/** --------------------------------------------------
* @Function	: main
* @Brief	: 主函数
* @param	: void
* @return	: int
---------------------------------------------------*/
int main(void)
{
	SysTick_Init();		// 延时函数初始化
}

/*********** Copyright © 2021 蓝风实验室 ***********/
